sky-mart/nrf5-arduino-framework-add-on/boards.txt
# Debug Menu
bluemacro_nrf52840.menu.debug.l0=Level 0 (Release)
bluemacro_nrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
bluemacro_nrf52840.menu.debug.l1=Level 1 (Error Message)
bluemacro_nrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
bluemacro_nrf52840.menu.debug.l2=Level 2 (Full Debug)
bluemacro_nrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
bluemacro_nrf52840.menu.debug.l3=Level 3 (Segger SystemView)
bluemacro_nrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
bluemacro_nrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# -------------------------------------------------------
# 
# JORIC BOARDS
#
# -------------------------------------------------------



# -------------------------------------------------------
# 
# NICE KEYBOARDS BOARDS
#
# -------------------------------------------------------

# ----------------------------------
# Nice Nano - 
# see https://docs.nicekeyboards.com/#/nice!nano/pinout_schematic
# ----------------------------------

nice_nano.name=Nice Keyboard's nice!nano
nice_nano.bootloader.tool=bootburn

# Upload
nice_nano.upload.tool=nrfutil
nice_nano.upload.protocol=nrfutil
nice_nano.upload.use_1200bps_touch=true
nice_nano.upload.wait_for_upload_port=true
nice_nano.upload.maximum_size=815104
nice_nano.upload.maximum_data_size=237568

# Build
nice_nano.build.mcu=cortex-m4
nice_nano.build.f_cpu=64000000
nice_nano.build.board=NICE_NANO
nice_nano.build.core=nRF5
nice_nano.build.variant=nice_nano
nice_nano.build.usb_manufacturer="Nice Keyboards"
nice_nano.build.usb_product="nice!nano"
nice_nano.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
nice_nano.build.ldscript=nrf52840_s140_v6.ld
nice_nano.build.vid=0x239A
nice_nano.build.pid=0x00B3
nice_nano.build.SoftDevicePresentFlag=-DSOFTDEVICE_PRESENT

# SofDevice Menu
nice_nano.menu.softdevice.s140v6=0.4.1 SoftDevice s140 6.1.1
nice_nano.menu.softdevice.s140v6.build.sd_name=s140
nice_nano.menu.softdevice.s140v6.build.bl_version=0.4.1
nice_nano.menu.softdevice.s140v6.build.sd_version=6.1.1
nice_nano.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
nice_nano.menu.debug.l0=Level 0 (Release)
nice_nano.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
nice_nano.menu.debug.l1=Level 1 (Error Message)
nice_nano.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
nice_nano.menu.debug.l2=Level 2 (Full Debug)
nice_nano.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
nice_nano.menu.debug.l3=Level 3 (Segger SystemView)
nice_nano.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
nice_nano.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# -------------------------------------------------------
# 
# NORDIC SEMICONDUCTORS BOARDS
#
# -------------------------------------------------------

# ----------------------------------
# Nordic nRF52832DK (PCA10040)
# ----------------------------------

# ----------------------------------
# Nordic nRF52840DK (PCA10056)
# ----------------------------------
pca10056.name=Nordic nRF52840DK (PCA10056)
pca10056.bootloader.tool=bootburn

# Upload
pca10056.upload.tool=nrfutil
pca10056.upload.protocol=nrfutil
pca10056.upload.use_1200bps_touch=true
pca10056.upload.wait_for_upload_port=true
pca10056.upload.maximum_size=815104
pca10056.upload.maximum_data_size=237568

# Build
pca10056.build.mcu=cortex-m4
pca10056.build.f_cpu=64000000
pca10056.build.board=NRF52840_PCA10056
pca10056.build.core=nRF5
pca10056.build.variant=pca10056
pca10056.build.usb_manufacturer="Nordic"
pca10056.build.usb_product="nRF52840 DK"
pca10056.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
pca10056.build.ldscript=nrf52840_s140_v6.ld
pca10056.build.vid=0x239A
pca10056.build.pid=0x8029
pca10056.build.SoftDevicePresentFlag=-DSOFTDEVICE_PRESENT

# SofDevice Menu
pca10056.menu.softdevice.s140v6=0.4.1 SoftDevice s140 6.1.1
pca10056.menu.softdevice.s140v6.build.sd_name=s140
pca10056.menu.softdevice.s140v6.build.bl_version=0.4.1
pca10056.menu.softdevice.s140v6.build.sd_version=6.1.1
pca10056.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
pca10056.menu.debug.l0=Level 0 (Release)
pca10056.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pca10056.menu.debug.l1=Level 1 (Error Message)
pca10056.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pca10056.menu.debug.l2=Level 2 (Full Debug)
pca10056.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pca10056.menu.debug.l3=Level 3 (Segger SystemView)
pca10056.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pca10056.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# ----------------------------------
# Nordic nRF52840 Dongle (PCA10059)
# ----------------------------------
pca10059.name=Nordic nRF52840 Dongle (PCA10059)
pca10059.bootloader.tool=bootburn

# Upload
pca10059.upload.tool=nrfutil
pca10059.upload.protocol=nrfutil
pca10059.upload.use_1200bps_touch=true
pca10059.upload.wait_for_upload_port=true
pca10059.upload.maximum_size=815104
pca10059.upload.maximum_data_size=237568

# Build
pca10059.build.mcu=cortex-m4
pca10059.build.f_cpu=64000000
pca10059.build.board=NRF52840_PCA10059
pca10059.build.core=nRF5
pca10059.build.variant=pca10059
pca10059.build.usb_manufacturer="Nordic"
pca10059.build.usb_product="nRF52840 DK"
pca10059.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
pca10059.build.ldscript=nrf52840_s140_v6.ld
pca10059.build.vid=0x239A
pca10059.build.pid=0x8029
pca10059.build.SoftDevicePresentFlag=-DSOFTDEVICE_PRESENT

# SofDevice Menu
pca10059.menu.softdevice.s140v6=0.4.1 SoftDevice s140 6.1.1
pca10059.menu.softdevice.s140v6.build.sd_name=s140
pca10059.menu.softdevice.s140v6.build.bl_version=0.4.1
pca10059.menu.softdevice.s140v6.build.sd_version=6.1.1
pca10059.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
pca10059.menu.debug.l0=Level 0 (Release)
pca10059.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pca10059.menu.debug.l1=Level 1 (Error Message)
pca10059.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pca10059.menu.debug.l2=Level 2 (Full Debug)
pca10059.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pca10059.menu.debug.l3=Level 3 (Segger SystemView)
pca10059.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pca10059.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# ----------------------------------
# Nordic nRF52840 Dongle (PCA10059) Nordic's bootloader
# ----------------------------------
pca10059NDFU.name=Nordic nRF52840 Dongle (PCA10059) Nordic's DFU bootloader
pca10059NDFU.bootloader.tool=bootburn

# Upload
pca10059NDFU.upload.tool=nrfutilNDFU
pca10059NDFU.upload.protocol=nordic_nrfutil_boot
pca10059NDFU.upload.use_1200bps_touch=false
pca10059NDFU.upload.wait_for_upload_port=false
pca10059NDFU.upload.maximum_size=913408
pca10059NDFU.upload.maximum_data_size=262136

# Build
pca10059NDFU.build.mcu=cortex-m4
pca10059NDFU.build.f_cpu=64000000
pca10059NDFU.build.board=NRF52840_PCA10059
pca10059NDFU.build.core=nRF5
pca10059NDFU.build.variant=pca10059
pca10059NDFU.build.usb_manufacturer="Nordic Semiconductor"
pca10059NDFU.build.usb_product="nRF52840 PCA10059"
pca10059NDFU.build.extra_flags=-DNRF52840_XXAA -DNDFU {build.flags.usb}
pca10059NDFU.build.ldscript=nrf52840_blank.ld
pca10059NDFU.build.vid=0x239A
pca10059NDFU.build.pid=0x8029
pca10059NDFU.build.SoftDevicePresentFlag=

# SofDevice Menu
pca10059NDFU.menu.softdevice.none=None
pca10059NDFU.menu.softdevice.none.build.sd_name=none
pca10059NDFU.menu.softdevice.none.build.bl_version=0
pca10059NDFU.menu.softdevice.none.build.sd_version=0.0.0
pca10059NDFU.menu.softdevice.none.build.sd_fwid=0x0000

# Debug Menu
pca10059NDFU.menu.debug.l0=Level 0 (Release)
pca10059NDFU.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pca10059NDFU.menu.debug.l1=Level 1 (Error Message)
pca10059NDFU.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pca10059NDFU.menu.debug.l2=Level 2 (Full Debug)
pca10059NDFU.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pca10059NDFU.menu.debug.l3=Level 3 (Segger SystemView)
pca10059NDFU.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pca10059NDFU.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Debug Output Menu
# pca10059NDFU.menu.debug_output.serial=Serial
# pca10059NDFU.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
# pca10059NDFU.menu.debug_output.serial1=Serial1
# pca10059NDFU.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
# pca10059NDFU.menu.debug_output.rtt=Segger RTT
# pca10059NDFU.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL